<!-------------------- navigation boxes ------------------------------>
<div class="p-5">
    <div class="container">
        <div class="row text-center navigation-boxes">

            <div class="col-md mt-2 Dreaming-reality">
                <div class="card bg-dark text-light h-100">
                    <img src="images/01.jpg" class="card-img-top" alt="...">
                    <div class="card-body text-center">
                        <h5 class="card-title text-red-400">رویا پردازی واقعیت...</h5>
                        <p class="card-text">
                            همه چی از رویا پردازی شروع میشه و اینکه تو ،تو رویاهات تصمیم میگیری چه چیزیو انتخاب کنی یا
                            به چی علاقه داری برنامه نویسی هم از رویا پردازی شروع میشه،تو رویاهات میبینی
                            که یک برنامه نویس شدی هر برنامه ای رو که بخوای میتونی بنویسی هر کاری بخوای میتونی با برنامه
                            نویس انجام بدی، تو رویاهات افکارت ب خودت میگی میخوام همچین برنامه ای یا نرم افزاری بنویسم که
                            اینکارو کنه یا مثلا یک وب سایت خیلی زیبا طراحی کنم و امثال این تفکرات ،ولی هر رویایی که
                            بخوای بهش برسی با به واقعیت تبدیلش کنی در ادامه ...
                        </p>
                    </div>
                </div>
            </div>
            <div class="col-md mt-2 road-map">
                <div class="card bg-dark text-light h-100">
                    <img src="images/02.jpg" class="card-img-top" alt="...">
                    <div class="card-body text-center">
                        <h5 class="card-title text-green-500">نقشه راه...</h5>
                        <p class="card-text">
                            خب برای تبدیل یک رویا پردازی به واقعیت ،تو به یک نقشه یا مسیر نیاز داری که به این نقشه میگیم
                            road map <span class="text-red-600">نقشه راه</span>
                            تو این نقشه راه ، به تو میگیم که برنامه نویسی و هکر شدن رو چجوری شروع کنی ، همیشه باید طبق
                            یک نقشه یک مسیر مشخص قدم برداری باید تابلوهای توی این جاده رو با دقت نگاه کنی ، این راه
                            نسبتا طولانی رو میتونی با خلاقیت و رویا پردازی کوتاترش کنی ! چجوری ، مثلا بین راه میرسی
                            به یک مبحث مثل جاواسکریپت با این زبان باید برنامه هایی که میشه با این زبان نوشت ، که تو
                            رویاهات بهشون فکر میکردی بنویسی...
                        </p>
                    </div>
                </div>
            </div>
            <div class="col-md mt-2 interest-practice">
                <div class="card bg-dark text-light h-100">
                    <img src="images/03.jpg" class="card-img-top" alt="...">
                    <div class="card-body text-center">
                        <h5 class="card-title">علاقه و تمرین زیاد...</h5>
                        <p class="card-text">
                            و دوتا نکته <span class="text-red-600">مهم مهم مهم مهم</span> و یکی از یکی مهمتر
                            اینکه باید علاقه داشته باشی به کاری که می خوای انجام بدی تفاوتی نداره اون کاری که می خوای
                            انجام بدی چیه در چه زمینه ای هست یا هرچی... مهم اینکه باید بهش علاقه داشته باشی تا بفهمیش
                            وقتی منطق اون کارو فهمیدی می تونی راحت تر اون کارو انجام بدی در نتیجه تو اون راهی که قدم
                            برداشتی زودتر پیشرفت میکنی و به هدفت میرسی ولی برنامه نویسی
                            خوشبختانه پایان نداره و تو هم نیاز نداری به پایان راه برنامه نویسی برسی مهم رسیدن به هدف هست
                            اونم با تمرین زیاد...
                        </p>
                    </div>
                </div>
            </div>

        </div>
    </div>
</div>
